{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/eca655bb-4827-4837-ba15-5714bfaf63b3')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/eca655bb-4827-4837-ba15-5714bfaf63b3')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "TS-IncidentDataDeleted_c",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "SecurityIncident\n| where Status == \"Deleted\"\n| project\n    TimeGenerated,\n    ModifiedBy,\n    Title,\n    IncidentNumber,\n    ProviderName,\n    ownerincident = tostring(Owner.userPrincipalName)\n| extend Query = strcat(\"SecurityIncident | where TimeGenerated > ago(180d) | where IncidentNumber == '\", IncidentNumber, \"'\")\n\n",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "DefenseEvasion"
                ],
                "techniques": [
                    "T1070"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": {
                    "IncidentDeleted": "Title",
                    "IncidentNumber": "IncidentNumber",
                    "HuntingQuery": "Query"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ModifiedBy"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}